package com.loiko.android_lab15_16.data

data class Lesson(
    val id: String,
    val subject: String,
    val professor: String,
    val time: String,
    val room: String,
    val type: String,
    val dayOfWeek: String
)

val sampleSchedule = listOf(
    Lesson("1", "Разработка мобильных приложений", "Леонтьев Д.А.", "08:00 - 09:35", "204", "Лекция", "Понедельник"),
    Lesson("2", "Математическое моделирование", "Трошина О.В.", "09:45 - 11:20", "301", "Практика", "Понедельник"),
    Lesson("3", "Системное программирование", "Токаев Т.И.", "08:00 - 09:35", "205", "Лекция", "Вторник"),
    Lesson("4", "Разработка программных модулей", "Донскова Д.А.", "09:45 - 11:20", "202", "Практика", "Вторник"),
    Lesson("5", "Иностранный язык", "Петрова Е.В.", "11:30 - 13:05", "115", "Практика", "Среда"),
    Lesson("6", "Разработка мобильных приложений", "Леонтьев Д.А.", "13:30 - 15:05", "204", "Практика", "Среда"),
    Lesson("7", "Системное программирование", "Токаев Т.И.", "08:00 - 09:35", "205", "Практика", "Четверг"),
    Lesson("8", "Математическое моделирование", "Трошина О.В.", "09:45 - 11:20", "301", "Лекция", "Четверг"),
    Lesson("9", "Физическая культура", "Магомедов С.К.", "11:30 - 13:05", "Спортзал", "Практика", "Пятница"),
    Lesson("10", "Разработка программных модулей", "Донскова Д.А.", "13:30 - 15:05", "202", "Лекция", "Пятница")
)
